#+LATEX_CLASS: org-ctex
#+TITLE: 算法笔记和板子
#+OPTIONS: _:nil
#+OPTIONS: ^:nil

** 快速幂

#+begin_src cpp
template <typename T> T pow(T a, T b) {
  T ans = 1;
  for (; b; b >>= 1LL) {
    if (b & 1)
      ans = ans * a;
    a = a * a;
  }
  return ans;
}

#include <iostream>
int main() { std::cout << pow(2ULL, 50ULL) << std::endl; }
#+end_src

#+RESULTS: :wrap src text
: 1125899906842624

**** 更相减损法

#+begin_src cpp :results output :exports both
int gcd(int a,int b)
{
    if(a==b)
        return a;
    if(a>b)
        return gcd(a-b,b);
    if(a<b)
        return gcd(b-a,a);
}

#include <iostream>
int main(){
    std::cout << gcd(6,9);
}
#+end_src

#+RESULTS:
: 3
**** 辗转相除法

#+begin_src cpp :results output :exports both
int gcd(int x, int y) { return y ? gcd(y, x % y) : x; }

#include <iostream>
int main(){
    std::cout << gcd(6,9);
}
#+end_src

#+RESULTS:
: 3

*** LCM

$lcm(a,b) = \frac{a \cdot b}{gcd(a,b)}$

#+begin_src cpp :results output :exports both
int gcd(int x, int y) { return y ? gcd(y, x % y) : x; }
int lcm(int a, int b) { return (a*b) / gcd(a,b); }

#include<iostream>
int main(){
    std::cout << lcm(6,9);
}
#+end_src

#+RESULTS:
: 18

